content/posts-org/new-aw.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-

* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Analysis workflow V2
#+AUTHOR:    Fei Ni
#+EMAIL:     feiphilips.ni@veritas.com
#+DATE:      2022-04-01
#+HUGO_CATEGORIES:
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here



* Facts
- R2V is common, and should be done before for other analysises.
- Some analysises may depend on all output data of R2V job (per batch/pool
- Some analysises may only depend on the particular sample's r2v output (per sample)
- Some analysises are required to be reviwed by person ( need be placed before pushing to R2V)
- Some analysises are not required to be reviewed by person (need be placed after pushing to R2V)
- Each analysis may generate metrics(tied with analysisID) for their own with their own logic (current we put such logic into lab library, which may not goot for *plug and play* model)
- the metadataJson from R2V job is the input for other analysises which are required review
  

* Questions:
 - for each analysises type, will they only depend on R2V? is it possible some analysis type may depend on antoher analysis type?
 

  
